import React from "react";

import "./style.scss";
import img1 from "../../imges/img1.svg";
import img2 from "../../imges/img2.png";
import img3 from "../../imges/img3.png";
import img4 from "../../imges/img4.png";
import img5 from "../../imges/img5.png";
import cardimg1 from "../../imges/cardimg1.png";
import cardimg2 from "../../imges/caardimg2.png";
import cardimg3 from "../../imges/cardimg3.png";
import { NavLink } from "react-router-dom";
import { Pagination } from "@mui/material";

let arry = [
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
  {
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",
  },
];
let arry22 = [
  {
    img: cardimg1,
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",

  },
  {
    img: cardimg1,
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",

  }, {
    img: cardimg1,
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",

  }, {
    img: cardimg1,
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",

  }, {
    img: cardimg1,
    date: "11.22.2022",
    text: "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ",

  },

];
export default function NewsPage() {
  return (
    <div className="first-page">
      <div className="under-menu">
        <div className="text">
          <h1>ՀՀ ՊՆ Վ. ՍԱՐԳՍՅԱՆԻ ԱՆՎԱՆ ՌԱԶՄԱԿԱՆ ՀԱՄԱԼՍԱՐԱՆ</h1>
          <div className="aphorism">
            <p>Գիտելիքը Ձեզ, նվաճումները Հայրենիքին․․․</p>
          </div>
        </div>
        <div className="languages-section">
          <div className="languages-div">
            <button>հայերեն</button>
            <button className="russian">русский</button>
            <button>english</button>
          </div>
        </div>
      </div>
      <div className="news-section-news">
         {arry22.map((item, index)=>{
            return (
              <div key={index} className="news-card" >
                <div className="card-img">

                   <img src={item.img}></img>
                </div>
                   <div className="news-card-text">
                      <p>{item.text}</p>
                      <div className="more">
                        <a>ավելին</a>
                        <p>{item.date}</p>
                      </div>
                   </div>
              </div>
            )
         })}
      </div>
      <div className="Pagination">
        <Pagination count={10} variant="outlined" shape="rounded" />
      </div> 
    </div>
  );
}
