import React, { useState } from "react";

import "./style.scss";
import { Button, ButtonBase, Pagination } from "@mui/material";
//"../../imges/"
import backroundEducation from "../../imges/backroundEducation.png"
import militryImg from "../../imges/militryImg.png"
import img111  from  "../../imges/image111.png"
import img222  from  "../../imges/image222.png"
import img333  from  "../../imges/img333.png"
import { NavLink } from "react-router-dom";

const educationText={
    militryEducation:["Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ, 1994 թվականի հունիսի  24-ին որպես Հայաստանի Հանրապետության պաշտպանության նախարարության բազմաբնույթ ռազմական հրամանատարական ուսումնարան:   Հայաստանի Հանրապետության Կառավարության թիվ 24 որոշմամբ 1998 թվականի հունվարի 16-ից ՀՀ ՊՆ բարձրագույն զինվորական բազմաբնույթ հրամանատարական ուսումնարանը վերակազմավորվել է Ռազմական ինստիտուտի, որն էլ 1998թ. տվել է իր առաջինª 4-ամյա կրթությամբ շրջանավարտները  Հայաստանի Հանրապետության Նախագահի թիվ 98 հրամանագրով 1999 թվականի դեկտեմբերի 27-ից èազմական ինստիտուտը  անվանակոչվել է  Հայաստանի Հանրապետության և Արցախի Հանրապետության ազգային հերոս, Սպարապետ Վազգեն Սարգսյանի անունով:",
    "Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ, 1994 թվականի հունիսի  24-ին որպես Հայաստանի Հանրապետության պաշտպանության նախարարության բազմաբնույթ ռազմական հրամանատարական ուսումնարան:  Հայաստանի Հանրապետության Կառավարության թիվ 24 որոշմամբ 1998 թվականի հունվարի 16-ից ՀՀ ՊՆ բարձրագույն զինվորական բազմաբնույթ հրամանատարական ուսումնարանը վերակազմավորվել է Ռազմական ինստիտուտի, որն էլ 1998թ. տվել է իր առաջինª 4-ամյա կրթությամբ շրջանավարտները: Հայաստանի Հանրապետության Նախագահի թիվ 98 հրամանագրով 1999 թվականի դեկտեմբերի 27-ից èազմական ինստիտուտը  անվանակոչվել է  Հայաստանի Հանրապետության և Արցախի Հանրապետության ազգային հերոս, Սպարապետ Վազգեն Սարգսյանի անունով:",
    "2001թ-ից Ռազմական ինստիտուտն անցել է երկու՝ մոտոհրաձգային և հրետանային մասնագիտություններով սպայական կադրերի պատրաստմանը: 2004թ-ից Ռազմական ինստիտուտում գործում է նաև սպաների որակավորման բարձրացման և ռազմամասնագիտական ուսուցման կենտրոնը, որտեղ իրենց մասնագիտական գիտելիքներն են կատարելագործում ԶՈՒ-ում ծառայություն անցնող սպաները:",
    "2003թ-ից ինտեգրվելով պետական բուհերի համակարգում՝ Ռազմական ինստիտուտը դարձել է հանրապետության պետական բուհերի լիիրավ անդամ: 2013թ-ից գործում է հրամանատարաշտաբային ֆակուլտետը (մագիստրատուրա), որտեղ մեկնարկել են «Միավորումների և զորամասերի կառավարում» մասնագիտությամբ՝ «Միավորումների և զորամասերի կառավարում» մագիստրոսի որակավորմամբ միամյա դասընթացները: ՀՀ պաշտպանության նախարարի 2017 թվականի դեկտեմբերի 18-ի թիվ 1356 հրամանով հրամանատարաշտաբային ֆակուլտետը վերանվանվել է «Մարշալ Հովհաննես Բաղրամյանի անվան հրամանատարաշտաբային ֆակուլտետ»:",
    "2014-2015 ուստարում իր պատմության մեջ առաջին անգամ Ռազմական համալսարանը  ունեցել է նաև իգական սեռի դիմորդներ, որոնց ընդունելության կարգը սահմանվել է ՀՀ պաշտպանության նախարարի հրամանով:Հայաստանի Հանրապետության Կառավարության 2016 թվականի ապրիլի 28-ի թիվ 446 որոշմամբ Ռազմական ինստիտուտը վերահայտարարվել է դառնալով Հայաստանի Հանրապետության պաշտպանության նախարարության «Վազգեն Սարգսյանի անվան ռազմական համալսարան» պետական հիմնարկ:",
    ],
    UniversityEducation:["Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ, 1994 թվականի հունիսի  24-ին որպես Հայաստանի Հանրապետության պաշտպանության նախարարության բազմաբնույթ ռազմական հրամանատարական ուսումնարան:   Հայաստանի Հանրապետության Կառավարության թիվ 24 որոշմամբ 1998 թվականի հունվարի 16-ից ՀՀ ՊՆ բարձրագույն զինվորական բազմաբնույթ հրամանատարական ուսումնարանը վերակազմավորվել է Ռազմական ինստիտուտի, որն էլ 1998թ. տվել է իր առաջինª 4-ամյա կրթությամբ շրջանավարտները  Հայաստանի Հանրապետության Նախագահի թիվ 98 հրամանագրով 1999 թվականի դեկտեմբերի 27-ից èազմական ինստիտուտը  անվանակոչվել է  Հայաստանի Հանրապետության և Արցախի Հանրապետության ազգային հերոս, Սպարապետ Վազգեն Սարգսյանի անունով:",
    "Հայաստանի Հանրապե kwcnw cwkoc wkl co cwocnw cow cwoc wտության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ, 1994 թվականի հունիսի  24-ին որպես Հայաստանի Հանրապետության պաշտպանության նախարարության բազմաբնույթ ռազմական հրամանատարական ուսումնարան:  Հայաստանի Հանրապետության Կառավարության թիվ 24 որոշմամբ 1998 թվականի հունվարի 16-ից ՀՀ ՊՆ բարձրագույն զինվորական բազմաբնույթ հրամանատարական ուսումնարանը վերակազմավորվել է Ռազմական ինստիտուտի, որն էլ 1998թ. տվել է իր առաջինª 4-ամյա կրթությամբ շրջանավարտները: Հայաստանի Հանրապետության Նախագահի թիվ 98 հրամանագրով 1999 թվականի դեկտեմբերի 27-ից èազմական ինստիտուտը  անվանակոչվել է  Հայաստանի Հանրապետության և Արցախի Հանրապետության ազգային հերոս, Սպարապետ Վազգեն Սարգսյանի անունով:",
    "2001թ-ից Ռազմական ինստիտուտն անցել է երկու՝ մոտոհրաձգային և հրետանային մասնագիտություններով սպայական կադրերի պատրաստմանը: 2004թ-ից Ռազմական ինստիտուտում գործում է նաև սպաների որակավորման բարձրացման և ռազմամասնագիտական ուսուցման կենտրոնը, որտեղ իրենց մասնագիտական գիտելիքներն են կատարելագործում ԶՈՒ-ում ծառայություն անցնող սպաները:",
    "2003թ-ից ինտեգրվելով պե  kwc lkw c w co clw cտական բուհերի համակարգում՝ Ռազմական ինստիտուտը դարձել է հանրապետության պետական բուհերի լիիրավ անդամ: 2013թ-ից գործում է հրամանատարաշտաբային ֆակուլտետը (մագիստրատուրա), որտեղ մեկնարկել են «Միավորումների և զորամասերի կառավարում» մասնագիտությամբ՝ «Միավորումների և զորամասերի կառավարում» մագիստրոսի որակավորմամբ միամյա դասընթացները: ՀՀ պաշտպանության նախարարի 2017 թվականի դեկտեմբերի 18-ի թիվ 1356 հրամանով հրամանատարաշտաբային ֆակուլտետը վերանվանվել է «Մարշալ Հովհաննես Բաղրամյանի անվան հրամանատարաշտաբային ֆակուլտետ»:",
    "2014-2015 ուստարում իր  oweoicwc oic oiwcoiw ocnw մեջ առաջին անգամ Ռազմական համալսարանը  ունեցել է նաև իգական սեռի դիմորդներ, որոնց ընդունելության կարգը սահմանվել է ՀՀ պաշտպանության նախարարի հրամանով:Հայաստանի Հանրապետության Կառավարության 2016 թվականի ապրիլի 28-ի թիվ 446 որոշմամբ Ռազմական ինստիտուտը վերահայտարարվել է դառնալով Հայաստանի Հանրապետության պաշտպանության նախարարության «Վազգեն Սարգսյանի անվան ռազմական համալսարան» պետական հիմնարկ:",
    ],
    applicant:["Հայաստանի Հանրապետության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ, 1994 թվականի հունիսի  24-ին որպես Հայաստանի Հանրապետության պաշտպանության նախարարության բազմաբնույթ ռազմական հրամանատարական ուսումնարան:   Հայաստանի Հանրապետության Կառավարության թիվ 24 որոշմամբ 1998 թվականի հունվարի 16-ից ՀՀ ՊՆ բարձրագույն զինվորական բազմաբնույթ հրամանատարական ուսումնարանը վերակազմավորվել է Ռազմական ինստիտուտի, որն էլ 1998թ. տվել է իր առաջինª 4-ամյա կրթությամբ շրջանավարտները  Հայաստանի Հանրապետության Նախագահի թիվ 98 հրամանագրով 1999 թվականի դեկտեմբերի 27-ից èազմական ինստիտուտը  անվանակոչվել է  Հայաստանի Հանրապետության և Արցախի Հանրապետության ազգային հերոս, Սպարապետ Վազգեն Սարգսյանի անունով:",
    "Հայաստանի Հ lkdcow ok cweo vvcw անրապե kwcnw cwkoc wkl co cwocnw cow cwoc wտության պաշտպանության նախարարության Վ.Սարգսյանի անվան ռազմական համալսարանը կազմավորվել է Հայաստանի Հանրապետության Կառավարության թիվ 279 որոշմամբ, 1994 թվականի հունիսի  24-ին որպես Հայաստանի Հանրապետության պաշտպանության նախարարության բազմաբնույթ ռազմական հրամանատարական ուսումնարան:  Հայաստանի Հանրապետության Կառավարության թիվ 24 որոշմամբ 1998 թվականի հունվարի 16-ից ՀՀ ՊՆ բարձրագույն զինվորական բազմաբնույթ հրամանատարական ուսումնարանը վերակազմավորվել է Ռազմական ինստիտուտի, որն էլ 1998թ. տվել է իր առաջինª 4-ամյա կրթությամբ շրջանավարտները: Հայաստանի Հանրապետության Նախագահի թիվ 98 հրամանագրով 1999 թվականի դեկտեմբերի 27-ից èազմական ինստիտուտը  անվանակոչվել է  Հայաստանի Հանրապետության և Արցախի Հանրապետության ազգային հերոս, Սպարապետ Վազգեն Սարգսյանի անունով:",
    "2001թ-ից Ռազմական ինստիտուտն անցել է երկու՝ մոտոհրաձգային և հրետանային մասնագիտություններով սպայական կադրերի պատրաստմանը: 2004թ-ից Ռազմական ինստիտուտում գործում է նաև սպաների որակավորման բարձրացման և ռազմամասնագիտական ուսուցման կենտրոնը, որտեղ իրենց մասնագիտական գիտելիքներն են կատարելագործում ԶՈՒ-ում ծառայություն անցնող սպաները:",
    "2003թ-ից ինտwkefniowmc cow jcj ocw inpejodq j dw cowcow cwեգրվելով պե  kwc lkw c w co clw cտական բուհերի համակարգում՝ Ռազմական ինստիտուտը դարձել է հանրապետության պետական բուհերի լիիրավ անդամ: 2013թ-ից գործում է հրամանատարաշտաբային ֆակուլտետը (մագիստրատուրա), որտեղ մեկնարկել են «Միավորումների և զորամասերի կառավարում» մասնագիտությամբ՝ «Միավորումների և զորամասերի կառավարում» մագիստրոսի որակավորմամբ միամյա դասընթացները: ՀՀ պաշտպանության նախարարի 2017 թվականի դեկտեմբերի 18-ի թիվ 1356 հրամանով հրամանատարաշտաբային ֆակուլտետը վերանվանվել է «Մարշալ Հովհաննես Բաղրամյանի անվան հրամանատարաշտաբային ֆակուլտետ»:",
    "2014-2015 ուստ oiweowe cowe clkw ciwlc wo clw ocmwl cw c wkcoiwencl pcmdkwej cpqmdewjcednc j coiwncwe cարում իր  oweoicwc oic oiwcoiw ocnw մեջ առաջին անգամ Ռազմական համալսարանը  ունեցել է նաև իգական սեռի դիմորդներ, որոնց ընդունելության կարգը սահմանվել է ՀՀ պաշտպանության նախարարի հրամանով:Հայաստանի Հանրապետության Կառավարության 2016 թվականի ապրիլի 28-ի թիվ 446 որոշմամբ Ռազմական ինստիտուտը վերահայտարարվել է դառնալով Հայաստանի Հանրապետության պաշտպանության նախարարության «Վազգեն Սարգսյանի անվան ռազմական համալսարան» պետական հիմնարկ:",
    ],

}
export default function EducationPage() {
    const [educationTitle, setEducationTitle]=useState(educationText.militryEducation)
    const [underimg, setUnderImg]=useState(img111)
    const [topImg, setTopImg]=useState(militryImg)
  return (
    <div className="first-page">
      <div className="under-menu">
        <img  src={topImg}/>
        <div className="text">
          <h1>ՀՀ ՊՆ Վ. ՍԱՐԳՍՅԱՆԻ ԱՆՎԱՆ ՌԱԶՄԱԿԱՆ ՀԱՄԱԼՍԱՐԱՆ</h1>
          <div className="aphorism">
            <p>Գիտելիքը Ձեզ, նվաճումները Հայրենիքին․․․</p>
          </div>
        </div>
        <div className="languages-section">
          <div className="languages-div">
            <button>հայերեն</button>
            <button className="russian">русский</button>
            <button>english</button>
          </div>
        </div>
      </div>
      <div style={{paddingBottom:"30px"}} className="news-section-news">
          <div className="buttons-div">
            <div>
            <ButtonBase onClick={()=>{
                setUnderImg(img111)
                setTopImg(militryImg)
                setEducationTitle(educationText.militryEducation)}}>Ռազմական կրթություն </ButtonBase>
            <ButtonBase onClick={()=>{
                setUnderImg(img222)
                setTopImg(backroundEducation)
                setEducationTitle(educationText.UniversityEducation)
                }} style={{borderLeft:"2px solid rgb(185, 185, 185)", borderRight:"2px solid rgb(185, 185, 185)"}} >Համալսարանական կրթություն</ButtonBase>
            <ButtonBase onClick={()=>{
                setUnderImg(img333)
                setTopImg(militryImg)
                setEducationTitle(educationText.applicant)}
                }> Դիմորդ </ButtonBase>
            </div>
          </div>
          <div className="education-text-div">
            {educationTitle.map((item)=>{
                return(
                    <>
                     <p style={{width:"80%"}}>{item}</p>
                     <br/>
                    </>
                )
            })}
            
          </div>
      </div>
      <div style={{width:"100%", marginBottom:"-5px"}} >
        <img style={{width:"100%", backgroundSize:"cover"}} src={underimg}></img>
      </div> 
    </div>
  );
}